# FabricationNetworkChangeService Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationNetworkChangeService Constructor
FabricationNetworkChangeService Class See Also
---
Creates a new instance of the FabricationNetworkChangeService class.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.2
# Syntax
C#
---
```text
public FabricationNetworkChangeService(
	Document document
)
```

Visual Basic
---
```text
Public Sub New ( _
	document As Document _
)
```

Visual C++
---
```text
public:
FabricationNetworkChangeService(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document A document in which to change the service or size of the selected fabrication parts.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace